Revit 2027 API
IFCFamilyInstanceExtrusionExportResults.GetExtrusionHandle Method
 Gets the extruded solid handle generated for the family instance.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAnyHandle GetExtrusionHandle()
Public Function GetExtrusionHandle As IFCAnyHandle
public:
IFCAnyHandle^ GetExtrusionHandle()
member GetExtrusionHandle : unit -> IFCAnyHandle
Return Value
IFCAnyHandle
 The handle. If the extrusion analysis failed for the family, this will be a handle with no value assigned.
See Also
Reference
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace